gnokii> --help
gnokii> --identify
IMEI         : 355849033413395
Manufacturer : huawei
Model        : E1756
Product name : E1756
Revision     : 11.126.07.04.00
gnokii> --identify
IMEI         : 355849033413395
Manufacturer : huawei
Model        : E1756
Product name : E1756
Revision     : 11.126.07.04.00
gnokii> --sendsms 3874980340
gnokii> 
gnokii> --help
gnokii> --hekl[K[Klp file[K[K[K[Ksecurity
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
Security options:
          --identify
          --getlocksinfo
          --entersecuritycode PIN|PIN2|PUK|PUK2|SEC [COMMAND]
          --getsecuritycodestatus
          --getsecuritycode
          --changesecuritycode PIN|PIN2|PUK|PUK2
gnokii> --help ge[K[K[K[K[K[K[K[K[K--help[K[K[K[Kgetsecuritycode
gnokii> --help file
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
File options:
          --getfilelist remote_path
          --getfiledetailsbyid [id]
          --getfileid remote_filename
          --getfile remote_filename [local_filename]
          --getfilebyid id [local_filename]
          --getallfiles remote_path
          --putfile local_filename remote_filename
          --deletefile remote_filename
          --deletefilebyid id
gnokii> --get[K[K[Khelp --getfilelist
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
gnokii> --[K[K--help getfilelist
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
gnokii> --ge[K[Kgetfilelist
gnokii> --getfilelist c
gnokii> --help monitor
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
Monitoring options:
          --monitor [delay|once]
          --getdisplaystatus
          --displayoutput
          --netmonitor {reset|off|field|devel|next|nr}
gnokii> --monitor once
Network: unknown, unknown ()
LAC: 0000 (0), CellID: 00000000 (0)
RFLevel: -1
Battery: -1
Power Source: No battery
SIM: Used 0, Free 0
EN: Used 0, Free 0
ON: Used 0, Free 0
CALL0: IDLE
CALL1: IDLE
gnokii> --netmonitor
gnokii> --netmonitor nxt
gnokii> --netmonitor field

gnokii> --getdisplaystatus
gnokii> --heko[K[Klp
gnokii> --version
gnokii> --help other
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
Misc options:
          --keysequence
          --enterchar
          --listnetworks
          --getnetworkinfo
gnokii> --listnetwoek[K[Krks
Network  Name
-----------------------------------------
202 01   Cosmote (Grecia)
202 05   Vodafone (Grecia)
202 09   Q-telecom (Grecia)
202 10   WIND (Grecia)
204 02   Tele2 Netherlands (PaÃ­ses Bajos)
204 04   Vodafone (PaÃ­ses Bajos)
204 08   KPN (PaÃ­ses Bajos)
204 12   Telfort / O2 (KPN) (PaÃ­ses Bajos)
204 16   T-Mobile / Ben (PaÃ­ses Bajos)
204 20   Orange / Dutchtone (T-mobile) (PaÃ­ses Bajos)
204 21   NS Railinfrabeheer B.V. (PaÃ­ses Bajos)
206 01   Proximus (BÃ©lgica)
206 10   Mobistar (BÃ©lgica)
206 20   BASE (BÃ©lgica)
208 01   France Telecom (Francia)
208 02   Orange (Francia)
208 05   Globalstar Europe (Francia)
208 06   Globalstar Europe (Francia)
208 07   Globalstar Europe (Francia)
208 10   SFR (Francia)
208 11   SFR (UMTS) (Francia)
208 13   SFR (Zones Blanches) (Francia)
208 20   Bouygues Telecom (Francia)
208 21   Bouygues Telecom (Francia)
208 88   Bouygues Telecom (Zones Blanches) (Francia)
213 03   Mobiland (Andorra)
214 01   Vodafone / Airtel (EspaÃ±a)
214 03   Orange / Amena (EspaÃ±a)
214 04   Yoigo / Xfera (EspaÃ±a)
214 05   Telefonica Moviles Espana (used by resellers) (EspaÃ±a)
214 06   Vodafone (used by resellers) (EspaÃ±a)
214 07   Telefonica Moviles Espana (Movistar) (EspaÃ±a)
214 08   Euskaltel (MVNO) (EspaÃ±a)
214 09   Orange (used by resellers) (EspaÃ±a)
216 01   Pannon (HungrÃ­a)
216 30   T-Mobile (HungrÃ­a)
216 70   Vodafone (HungrÃ­a)
218 01   Cronet (Bosnia y Herzegovina)
218 03   Eronet Mobile Communications Ltd. (Bosnia y Herzegovina)
218 05   MOBI's (Mobilina Srpske) (Bosnia y Herzegovina)
218 19   PTT Bosnia (Bosnia y Herzegovina)
218 90   PE PTT BIH (Bosnia y Herzegovina)
219 01   T-Mobile Croatia (Croacia)
219 02   Tele2 (Croacia)
219 10   VIPnet (Croacia)
220 01   Telenor (Serbia)
220 02   ProMonte (Serbia)
220 03   MTS - Telekom Srbija (Serbia)
220 04   T-Mobile Montenegro (Serbia)
220 05   VIP Mobile (Serbia)
222 01   TIM (Italia)
222 02   Elsacom (Italia)
222 10   Vodafone (Italia)
222 30   RFI (Italia)
222 77   IPSE 2000 (Italia)
222 88   Wind (Italia)
222 98   Blu (Italia)
222 99   H3G (Italia)
226 01   Vodafone (RumanÃ­a)
226 03   Cosmote (RumanÃ­a)
226 05   digi tel (RumanÃ­a)
226 10   Orange (RumanÃ­a)
228 01   Swisscom NATEL / Telecom FL A (Suiza)
228 02   diAx mobile / Sunrise (Suiza)
228 03   Orange (Suiza)
228 05   Togewanet AG (Suiza)
228 06   SBB AG (Suiza)
228 07   IN&Phone SA (Suiza)
228 08   Tele2 Telecommunications AG (Suiza)
228 12   Sunrise UMTS (Suiza)
228 50   3G Mobile AG (Suiza)
228 51   BebbiCell (Suiza)
230 01   T-Mobile Czech Republic (RepÃºblica Checa)
230 02   Telefonica O2 Czech Republic (RepÃºblica Checa)
230 03   Vodafone (RepÃºblica Checa)
230 98   SZDC s.o. (RepÃºblica Checa)
230 99   Cesky Mobil a.s., R&D Centre (RepÃºblica Checa)
231 01   Orange (Eslovaquia)
231 02   T-Mobile Slovensko (Eslovaquia)
231 03   Unient Communications (Eslovaquia)
231 04   T-Mobile Slovensko (UMTS) (Eslovaquia)
231 05   Mobile Entertainment Company (UMTS) (Eslovaquia)
231 06   Telefonica O2 Slovakia (Eslovaquia)
231 99   ZSR (Eslovaquia)
232 01   Mobilkom Austria / A1 (Austria)
232 03   T-Mobile (Austria)
232 05   One / Orange Oesterreich (Austria)
232 07   T-Mobile Austria (Austria)
232 09   Tele2 (Austria)
232 10   Hutchison 3G - '3' (Austria)
234 00   Virgin 3510i (Reino Unido)
234 02   O2 (Reino Unido)
234 03   Jersey Telenet / Bharti / AirTel (Reino Unido)
234 10   Cellnet / O2 (Reino Unido)
234 11   O2 (Reino Unido)
234 12   Railtrack (Reino Unido)
234 15   Vodafone (Reino Unido)
234 18   Cloud9 (Reino Unido)
234 20   3 / Hutchison 3G (Reino Unido)
234 30   T-Mobile (Reino Unido)
234 31   Virgin (Reino Unido)
234 32   Virgin (Reino Unido)
234 33   Orange (Reino Unido)
234 34   Orange (Reino Unido)
234 50   Jersey Telecom / Wave (Guernsey) (Reino Unido)
234 55   Cable & Wireless Guernsey / Sure Mobile (Jersey) (Reino Unido)
234 58   Manx Telecom (Reino Unido)
238 01   TDC (Dinamarca)
238 02   Sonofon (Dinamarca)
238 03   MIGway A/S (Dinamarca)
238 04   TetraStar (Dinamarca)
238 05   Sonofon (Dinamarca)
238 06   3 (Dinamarca)
238 10   TDC (Dinamarca)
238 20   Telia (Dinamarca)
238 30   Telia (Dinamarca)
238 77   Tele2 (Dinamarca)
240 01   Telia (Suecia)
240 02   3 (Suecia)
240 03   Nordisk Mobiltelefon (Suecia)
240 04   3G Infrastructure Services (Suecia)
240 05   Sweden 3G  (Owned by Telia and Tele2) (Suecia)
240 06   Telenor (Suecia)
240 07   Tele2 (Suecia)
240 08   Telenor (Suecia)
240 09   Telenor Mobile Sverige (Suecia)
240 10   SpringMobil (Suecia)
240 20   Wireless Maingate (Suecia)
240 21   Banverket (Suecia)
242 01   Telenor Mobil (Noruega)
242 02   NetCom GSM (Noruega)
242 03   Teletopia (Noruega)
242 04   Tele2 (Noruega)
242 05   Network Norway (Noruega)
242 07   Ventelo (Noruega)
242 56   Chess Communication (Noruega)
244 03   DNA ltd. (formerly: Telia) (Finlandia)
244 04   Finnet Networks Ltd. (Finlandia)
244 05   Elisa (Finlandia)
244 09   Finnet Group / Lannen Puhelin / Helsingin Puhelin (Finlandia)
244 12   FinNet (Finlandia)
244 14   Alands Mobiltelefon AB (Finlandia)
244 16   Oy Finland Tele2 AB (Finlandia)
244 21   Elisa (formerly: Saunalahti Group Ltd.) (Finlandia)
244 91   TeliaSonera Corporation (Finlandia)
246 01   Omnitel (Lituania)
246 02   UAB Bite GSM (Lituania)
246 03   Tele 2 (Lituania)
247 01   Latvian Mobile Tel. (Letonia)
247 02   Tele 2 / BALTCOM GSM (Letonia)
247 03   Telekom Baltija (Letonia)
247 04   Beta Telecom (Letonia)
248 01   Estonian Mobile Telecom (Estonia)
248 02   Elisa (Estonia)
248 03   Tele 2 (Estonia)
248 04   OY Top Connect (Estonia)
248 05   AS Bravocom Mobiil (Estonia)
248 06   OY ViaTel (Estonia)
250 01   MTS (FederaciÃ³n Rusa)
250 02   Megafon (FederaciÃ³n Rusa)
250 03   NCC / Nizhegorodskaya Cellular Communications (FederaciÃ³n Rusa)
250 04   Sibchallenge (FederaciÃ³n Rusa)
250 05   ETK / Yeniseytelecom (FederaciÃ³n Rusa)
250 07   Zao SMARTS (FederaciÃ³n Rusa)
250 10   Dontelekom (FederaciÃ³n Rusa)
250 11   Orensot (FederaciÃ³n Rusa)
250 12   Baykal Westcom / New Telephone Company / Far Eastern Cellular (FederaciÃ³n Rusa)
250 13   Kuban GSM (FederaciÃ³n Rusa)
250 14   Di-ex / Teleset LTD (FederaciÃ³n Rusa)
250 16   NTC / New Telephone Company (FederaciÃ³n Rusa)
250 17   Ermak RMS (FederaciÃ³n Rusa)
250 19   Volgograd Mobile / INDIGO (FederaciÃ³n Rusa)
250 20   Tele2 / ECC (FederaciÃ³n Rusa)
250 28   Extel (FederaciÃ³n Rusa)
250 39   Uraltel / Uralsvyazinform (FederaciÃ³n Rusa)
250 44   Stavtelesot / North Caucasian GSM (FederaciÃ³n Rusa)
250 92   Primtelefon (FederaciÃ³n Rusa)
250 93   Telecom XXI (FederaciÃ³n Rusa)
250 99   Beeline (FederaciÃ³n Rusa)
255 01   MTS (Ucrania)
255 02   Beeline (Ucrania)
255 03   Kyivstar (Ucrania)
255 04   IT CDMA/InterTelecom (Ucrania)
255 05   Golden Telecom (Ucrania)
255 06   life:)/A-stelit (Ucrania)
255 07   Utel/UkrTelecom (Ucrania)
255 21   PEOPLEnet/Telesystems of Ukraine (Ucrania)
255 23   ITC CDMA Ukraine (Ucrania)
257 01   Velcom (Bielorrusia)
257 02   MTS (Bielorrusia)
257 04   BeST (Bielorrusia)
259 01   Orange (Moldavia)
259 02   Moldcell (Moldavia)
259 03   Unite (Moldavia)
259 04   Eventis (Moldavia)
260 01   Plus (Polkomtel) (Polonia)
260 02   Era (PTC) (Polonia)
260 03   Orange (PTK Centertel) (Polonia)
260 04   Tele2 Polska (Polonia)
260 06   Play (P4) (Polonia)
260 07   Premium Internet (Polonia)
260 08   E-Telko (Polonia)
260 09   Telekomunikacja Kolejowa (Polonia)
260 10   Telefonu Opalenickie (Polonia)
260 12   Halo Polsat (Polonia)
262 01   T-Mobile / D1 - DeTe Mobil (Alemania)
262 02   Vodafone (Alemania)
262 03   E-Plus (Alemania)
262 04   Vodafone (Alemania)
262 05   E-Plus (Alemania)
262 06   T-Mobile (Alemania)
262 07   O2 (Alemania)
262 08   O2 (Alemania)
262 09   Vodafone (Alemania)
262 10   Arcor AG & Co (Alemania)
262 11   O2 (Alemania)
262 12   Dolphin Telecom (Alemania)
262 13   Mobilcom Multimedia (Alemania)
262 14   Group 3G UMTS (Alemania)
262 15   Airdata (Alemania)
262 16   vistream (MVNO) (Alemania)
262 60   DB Telematik (Alemania)
262 76   Siemens AG (Alemania)
262 77   E-Plus (Alemania)
266 01   Gibraltar Telecoms GibTel (Gibraltar)
268 01   Vodafone (Portugal)
268 03   Optimus (Portugal)
268 06   TMN (Portugal)
270 01   P&T Luxembourg (Luxemburgo)
270 77   Tango (Luxemburgo)
270 99   Voxmobile (Luxemburgo)
272 01   Vodafone (Irlanda)
272 02   O2 (Irlanda)
272 03   Meteor (Irlanda)
272 04   Access Telecom (Irlanda)
272 07   Eircom (Irlanda)
272 09   Clever Communications (Irlanda)
274 01   Iceland Telecom Siminn (Islandia)
274 02   Vodafone (Islandia)
274 03   Islandssimi ehf (Islandia)
274 04   IMC Islande ehf (Islandia)
274 07   IceCell ehf (Islandia)
276 01   Albanian Mobile Communications (Albania)
276 02   Vodafone (Albania)
278 01   Vodafone (Malta)
278 21   go mobile (Malta)
280 01   Cytamobile-Vodafone (Chipre)
280 10   Areeba (Chipre)
282 01   Geocell Limited (Georgia)
282 02   Magticom GSM (Georgia)
282 03   Iberiatel Ltd. (Georgia)
282 04   Mobitel (Georgia)
283 01   ArmenTel (Armenia)
283 05   Vivacell (Armenia)
284 01   M-Tel (Bulgaria)
284 03   Vivatel (Bulgaria)
284 05   GLOBUL (Bulgaria)
286 01   Turkcell (TurquÃ­a)
286 02   Vodafone (Formerly known as Telsim) (TurquÃ­a)
286 03   Avea (Formerly known as Aria) (TurquÃ­a)
286 04   Aycell (Merged into Aria to form Avea) (TurquÃ­a)
288 01   Faroese Telecom (Islas Feroe)
288 02   Kell GSM (Islas Feroe)
290 01   Tele Greenland (Groenlandia)
292 01   Prima (San Marino Telecom) (San Marino)
293 40   Si Mobil (Eslovenia)
293 41   Mobitel (Eslovenia)
293 70   Vega (Eslovenia)
294 01   Mobimak / T-Mobile Macedonia (Republic of Macedonia)
294 02   Cosmofon (Republic of Macedonia)
295 02   Viag Europlatform AG (Liechtenstein)
295 05   Mobilkom (Liechtenstein) AG (Liechtenstein)
295 77   Tele2 AG (Liechtenstein)
297 03   m:tel (Montenegro)
302 360  Telus Mobility (CanadÃ¡)
302 361  Telus Mobility (CanadÃ¡)
302 370  Fido brand Rogers wireless (CanadÃ¡)
302 620  ICE Wireless (CanadÃ¡)
302 651  Bell Mobility (CanadÃ¡)
302 652  BC Tel Mobility (CanadÃ¡)
302 653  Telus Mobility (CanadÃ¡)
302 654  Sask Tel Mobility (CanadÃ¡)
302 655  MTS Mobility (CanadÃ¡)
302 656  Tbay Mobility (CanadÃ¡)
302 657  Telus (Quebec) Mobility (CanadÃ¡)
302 701  MB Tel Mobility (CanadÃ¡)
302 702  MT&T Mobility (CanadÃ¡)
302 703  New Tel Mobility (CanadÃ¡)
302 710  Globalstar (CanadÃ¡)
302 720  Rogers Wireless (CanadÃ¡)
308 01   St. Pierre-et-Miquelon Telecom (San Pedro y Miquelon)
310 000  Mid-Tex Celular (Estados Unidos de AmÃ©rica)
310 010  MCI (Estados Unidos de AmÃ©rica)
310 012  Verizon Wireless (Estados Unidos de AmÃ©rica)
310 013  MobileTel (Estados Unidos de AmÃ©rica)
310 014  Testing (Estados Unidos de AmÃ©rica)
310 016  Cricket Communications (Estados Unidos de AmÃ©rica)
310 017  North Sight Communications Inc. (Estados Unidos de AmÃ©rica)
310 020  APC Sprint Spectrum / Union Telephone Company (Estados Unidos de AmÃ©rica)
310 030  Centennial Communications (Estados Unidos de AmÃ©rica)
310 032  IT&E Overseas, Inc. (Estados Unidos de AmÃ©rica)
310 033  Guam Telephone Authority (Estados Unidos de AmÃ©rica)
310 034  Nevada Wireless LLC (Estados Unidos de AmÃ©rica)
310 040  Concho Cellular Telephone Co., Inc. (Estados Unidos de AmÃ©rica)
310 060  Consolidated Telcom (Estados Unidos de AmÃ©rica)
310 070  Highland Cellular, Inc. (Estados Unidos de AmÃ©rica)
310 080  Corr Wireless Communications LLC (Estados Unidos de AmÃ©rica)
310 090  Edge Wireless (Estados Unidos de AmÃ©rica)
310 100  New Mexico RSA 4 East Ltd. Partnership (Estados Unidos de AmÃ©rica)
310 110  Wireless 2000 Telephone (Estados Unidos de AmÃ©rica)
310 150  Cingular / Bell South / BellSouth Mobility DCS (Estados Unidos de AmÃ©rica)
310 160  T-Mobile / Omnipoint Communications (Estados Unidos de AmÃ©rica)
310 170  Cingular / Pacific Bell Wireless / T-Mobile (Estados Unidos de AmÃ©rica)
310 180  Cingular / West Central Wireless (Estados Unidos de AmÃ©rica)
310 190  Alaska Telecom Mobile / Alaska Wireless Communications (Estados Unidos de AmÃ©rica)
310 200  T-Mobile / T-Mobile Idaho / Oregon / Washington State (Estados Unidos de AmÃ©rica)
310 210  T-Mobile / T-Mobile Iowa (Estados Unidos de AmÃ©rica)
310 220  T-Mobile / T-Mobile Kansas / Oklahoma (Estados Unidos de AmÃ©rica)
310 230  T-Mobile / T-Mobile Utah (Estados Unidos de AmÃ©rica)
310 240  T-Mobile / T-Mobile New Mexico / Texas / Arizona (Estados Unidos de AmÃ©rica)
310 250  T-Mobile / T-Mobile Hawaii (Estados Unidos de AmÃ©rica)
310 260  T-Mobile / Western Wireless / Voicestream (Estados Unidos de AmÃ©rica)
310 270  T-Mobile / Powertel (Estados Unidos de AmÃ©rica)
310 280  T-Mobile (Estados Unidos de AmÃ©rica)
310 290  T-Mobile (Estados Unidos de AmÃ©rica)
310 300  T-Mobile (Estados Unidos de AmÃ©rica)
310 310  T-Mobile / T-Mobile Florida / Aerial Communications (Estados Unidos de AmÃ©rica)
310 340  High Plains Midwest LLC (Westlink Communications) (Estados Unidos de AmÃ©rica)
310 380  AT&T Wireless / Cingular (Estados Unidos de AmÃ©rica)
310 410  AT&T (Estados Unidos de AmÃ©rica)
310 420  Cincinnati Bell Wireless (Estados Unidos de AmÃ©rica)
310 430  Alaska Digitel (Estados Unidos de AmÃ©rica)
310 450  North East Cellular (Estados Unidos de AmÃ©rica)
310 460  TMP Corporation (Estados Unidos de AmÃ©rica)
310 470  Guam Wireless Telephone Company (Estados Unidos de AmÃ©rica)
310 480  Choice Phone (Estados Unidos de AmÃ©rica)
310 490  Triton PCS (Estados Unidos de AmÃ©rica)
310 500  Public Service Cellular (Estados Unidos de AmÃ©rica)
310 510  Airtel Wireless (Estados Unidos de AmÃ©rica)
310 520  VeriSign (Estados Unidos de AmÃ©rica)
310 530  West Virginia Wireless (Estados Unidos de AmÃ©rica)
310 540  Oklahoma Western Telephone Company (Estados Unidos de AmÃ©rica)
310 560  American Cellular Corporation (Estados Unidos de AmÃ©rica)
310 570  MTPCS, LLC / Chinook Wireless (Estados Unidos de AmÃ©rica)
310 580  PCS ONE (Estados Unidos de AmÃ©rica)
310 590  Western Wireless Corporation / Alltel (Estados Unidos de AmÃ©rica)
310 610  Elkhart Telephone Co. / Epic Touch Co. (Estados Unidos de AmÃ©rica)
310 620  Coleman County Telecommunications / Trans Texas PCS (Estados Unidos de AmÃ©rica)
310 630  Comtel PCS Mainstreet LP (Estados Unidos de AmÃ©rica)
310 640  Airadigm Communications (Estados Unidos de AmÃ©rica)
310 660  T-Mobile (Estados Unidos de AmÃ©rica)
310 670  Northstar (Estados Unidos de AmÃ©rica)
310 680  Noverr Publishing, Inc. dba NPI Wireless (Estados Unidos de AmÃ©rica)
310 690  Conestoga Wireless Company (Estados Unidos de AmÃ©rica)
310 730  SeaMobile (Estados Unidos de AmÃ©rica)
310 740  Telemetrix Technologies (Estados Unidos de AmÃ©rica)
310 760  Panhandle Telecommunications Systems Inc. (Estados Unidos de AmÃ©rica)
310 770  Iowa Wireless Services (Estados Unidos de AmÃ©rica)
310 780  Message Express Company dba Airlink PCS (Estados Unidos de AmÃ©rica)
310 790  PinPoint Communications (Estados Unidos de AmÃ©rica)
310 800  T-Mobile (Estados Unidos de AmÃ©rica)
310 830  Caprock Cellular (Estados Unidos de AmÃ©rica)
310 850  Aeris Communications (Estados Unidos de AmÃ©rica)
310 870  Kaplan Telephone Company (Estados Unidos de AmÃ©rica)
310 880  Advantage Cellular Systems (Estados Unidos de AmÃ©rica)
310 890  Rural Cellular Corporation (Estados Unidos de AmÃ©rica)
310 900  Taylor Telecommunications (Estados Unidos de AmÃ©rica)
310 910  Southern IL RSA Partnership / First Cellular of Southern Illinois (Estados Unidos de AmÃ©rica)
310 940  Poka Lambro Telecommunications (Estados Unidos de AmÃ©rica)
310 950  Texas RSA 1 dba XIT Cellular (XIT Wireless) (Estados Unidos de AmÃ©rica)
310 970  Globalstar (Estados Unidos de AmÃ©rica)
310 980  AT&T Wireless Services (Estados Unidos de AmÃ©rica)
311 000  Mid-Tex Cellular (Estados Unidos de AmÃ©rica)
311 010  Chariton Valley Communications (Estados Unidos de AmÃ©rica)
311 020  Missouri RSA 5 Partnership (Estados Unidos de AmÃ©rica)
311 030  Indigo Wireless (Estados Unidos de AmÃ©rica)
311 040  Commet Wireless (Estados Unidos de AmÃ©rica)
311 050  Farmers Cellular Telephone (Estados Unidos de AmÃ©rica)
311 060  Farmers Cellular Telephone (Estados Unidos de AmÃ©rica)
311 070  Easterbrooke Cellular Corporation (Estados Unidos de AmÃ©rica)
311 080  Pine Cellular / Pine Telephone Company (Estados Unidos de AmÃ©rica)
311 090  Siouxland PCS (Estados Unidos de AmÃ©rica)
311 100  High Plains Wireless (Estados Unidos de AmÃ©rica)
311 110  High Plains Wireless (Estados Unidos de AmÃ©rica)
311 120  Choice Phone (Estados Unidos de AmÃ©rica)
311 130  Amarillo License (Estados Unidos de AmÃ©rica)
311 140  MBO Wireless / Cross Telephone Company (Estados Unidos de AmÃ©rica)
311 150  Wilkes Cellular (Estados Unidos de AmÃ©rica)
311 160  Endless Mountains Wireless (Estados Unidos de AmÃ©rica)
311 180  Cingular Wireless / Licensee Pacific Telesis Mobile Services (Estados Unidos de AmÃ©rica)
311 210  Farmers Cellular Telephone (Estados Unidos de AmÃ©rica)
316 010  Nextel Communications (Estados Unidos de AmÃ©rica)
316 011  Southern Communications Services (Estados Unidos de AmÃ©rica)
334 01   Nextel Mexico (MÃ©xico)
334 02   Telcel (MÃ©xico)
334 03   Telefonica Moviles Mexico (movistar) (MÃ©xico)
338 020  Cable & Wireless (Barbados)
338 05   Digicel (Barbados)
338 050  Mossel Digicel (Barbados)
338 070  ODJ (Barbados)
338 180  C&W (Barbados)
340 01   Orange Caraibe Mobiles (Guadalupe)
340 02   Outremer Telecom (Guadalupe)
340 03   Saint Martin et Saint Barthelemy Telcell Sarl (Guadalupe)
340 20   Digicel (ex-Bouygues Telecom Caraibes) (Guadalupe)
342 600  Cable & Wireless (Barbados) Ltd. (Barbados)
342 820  Sunbeach Communications (Barbados)
344 030  APUA (Antigua y Barbuda)
344 920  bmobile (Antigua y Barbuda)
344 930  Digicel (Antigua y Barbuda)
346 140  Cable & Wireless (Cayman) (Islas CaimÃ¡n)
348 570  Caribbean Cellular Telephone (Islas VÃ­rgenes BritÃ¡nicas)
362 51   TELCELL GSM (Antillas Holandesas)
362 69   CT GSM (Antillas Holandesas)
362 91   SETEL GSM / CHIPP (Antillas Holandesas)
363 01   Setar (Aruba)
363 20   Digicell (Aruba)
365 10   Weblinks Limited (Anguila)
368 01   Cubacel (Cuba)
370 01   Orange Dominicana (RepÃºblica Dominicana)
370 02   Compania Dominicana de Telefonos, C por A. (Claro) (RepÃºblica Dominicana)
370 03   Tricom S.A. (RepÃºblica Dominicana)
370 04   Centennial Dominicana (RepÃºblica Dominicana)
374 12   TSTT (Trinidad y Tobago)
374 13   Digicel (Trinidad y Tobago)
400 01   Azercell (AzerbayÃ¡n)
400 02   Bakcell (AzerbayÃ¡n)
400 03   Catel (AzerbayÃ¡n)
400 04   Nar Mobile (AzerbayÃ¡n)
401 01   K-Mobile/Beeline/ Kar-Tel (KazajistÃ¡n)
401 02   K'Cell / JSC "Kazakhtelecom" (KazajistÃ¡n)
401 07   Dalacom / JSC "Altel" (KazajistÃ¡n)
401 77   NEO Telecom / JSC "Kazakhtelecom" (KazajistÃ¡n)
402 17   B-Mobile (BhutÃ¡n)
404 01   AirCell Digilink (India)
404 02   Airtel (India)
404 03   Airtel / Bharti Telenet (India)
404 04   Idea Cellular (India)
404 05   Hutch / Fascel (India)
404 06   Airtel (India)
404 07   TATA Cellular / Idea Cellular (India)
404 09   Reliance Telecom Private (India)
404 10   Airtel (India)
404 11   Essar / Sterling Cellular (India)
404 12   Escotel Mobile Comms (India)
404 13   Hutchison Essar South (India)
404 14   Spice Communications / Modi Telstra Modicom (India)
404 15   Aircell Digilink Essar Cellph. (India)
404 20   Vodafone Mumbai (formerly Hutchison Maxtouch / Orange/ Hutch Mumbai) (India)
404 21   BPL Mobile Mumbai (India)
404 22   Idea Cellular Maharashtra & Goa (India)
404 24   Idea Cellular (India)
404 27   BPL USWest Cellular / Cellular Comms (India)
404 30   Usha Martin Tel. Command (India)
404 31   Airtel (India)
404 34   BSNL (India)
404 36   Reliance Telecom Private (India)
404 38   BSNL (India)
404 40   Airtel (India)
404 41   RPG MAA (India)
404 42   Srinivas Cellcom / Aircel (India)
404 43   BPL Mobile Cellular (India)
404 44   Spice (India)
404 45   Airtel (India)
404 46   BPL Cellular (Now vodafone) (India)
404 49   Airtel (India)
404 50   Reliance Telecom Private (India)
404 51   BSNL (India)
404 52   Reliance Telecom Private (India)
404 53   BSNL (India)
404 54   BSNL (India)
404 55   BSNL (India)
404 56   Escotel Mobile Communications Private (India)
404 57   BSNL (India)
404 58   BSNL (India)
404 59   BSNL (India)
404 60   Aircell Digilink (India)
404 62   BSNL (India)
404 64   BSNL (India)
404 66   BSNL (India)
404 67   Reliance Telecom Private (India)
404 68   Mahanagar Telephone Nigam (India)
404 69   DOLPHIN / Mahanagar Telephone Nigam (India)
404 70   Airtel (India)
404 71   BSNL (India)
404 72   BSNL Kerala (India)
404 73   BSNL (India)
404 74   BSNL (India)
404 75   BSNL / CellOne (India)
404 76   BSNL (India)
404 77   BSNL (India)
404 78   BTA Cellcom (India)
404 80   BSNL (India)
404 81   BSNL (India)
404 82   Escorts Telecom (India)
404 83   Reliable Internet Services (India)
404 84   Hutchison Essar South (India)
404 85   Reliance Telecom Private (India)
404 86   Hutchinson Essar South (India)
404 87   Escorts Telecom (India)
404 88   Escorts Telecom (India)
404 89   Escorts Telecom (India)
404 90   Airtel Maharashtra & Goa (India)
404 92   Airtel Mumbai (India)
404 93   Airtel Gujrat (India)
404 94   Airtel (India)
404 95   Airtel (India)
404 96   Airtel (India)
404 97   Airtel (India)
404 98   Airtel (India)
405 51   Airtel (India)
405 52   Airtel (India)
405 66   Hutch (India)
410 01   Mobilink (PakistÃ¡n)
410 03   UFONE (PakistÃ¡n)
410 04   Paktel (PakistÃ¡n)
410 06   Telenor (PakistÃ¡n)
410 07   Warid (PakistÃ¡n)
412 01   Afghan Wireless Communication Company (AfganistÃ¡n)
412 20   Roshan (AfganistÃ¡n)
412 40   Areeba (AfganistÃ¡n)
412 50   Etisalat (AfganistÃ¡n)
413 01   Mobitel Lanka Ltd. (Sri Lanka)
413 02   Dialog Telekom PLC. (Sri Lanka)
413 03   Celtel Lanka Ltd / Tigo. (Sri Lanka)
413 08   Hutch Sri Lanka. (Sri Lanka)
414 01   Myanmar Post and Telecommunication (Birmania)
415 01   Alfa (LÃ­bano)
415 03   MTC Touch (LÃ­bano)
416 01   J.M.T.S. Fastlink (Jordania)
416 77   MobCom (Jordania)
417 01   SyriaTel (Syria)
417 02   Spacetel Syria (Syria)
417 09   Syrian Telecom Est. MOBILE (Syria)
418 01   Iraq Telecom (Irak)
419 02   Mobile Telecoms / MTCNet (Kuwait)
419 03   Wataniya (Kuwait)
420 01   Saudi Telecom / Ministry of PTT Al Jawal (Arabia SaudÃ­)
420 07   Electronics App' Est. / EAE (Arabia SaudÃ­)
421 01   SabaFon (Yemen)
421 02   MTN (Yemen)
422 02   General Telecoms (OmÃ¡n)
424 02   Etisalat (Emiratos Ãrabes Unidos)
424 03   Emirates Integrated Telecommunications Company (du) (Emiratos Ãrabes Unidos)
425 01   Orange (Israel)
425 02   Cellcom (Israel)
425 03   Pelephone (Israel)
425 77   Mirs (Israel)
426 01   Batelco (Bahrein)
426 02   MTC-VFBH (Bahrein)
427 01   Q-Net / Q-Tel QATARNET (Qatar)
428 88   Unitel (Mongolia)
428 99   Mobicom (Mongolia)
429 01   Nepal Telecommunications (Nepal)
429 02   Spice Nepal Pvt. Ltd. (Nepal)
429 03   United Telecom Ltd. (Nepal)
432 11   Mobile Communications Company of Iran / IR-MCI (Iran)
432 14   Telecommunication Kish Co. (Kifzo) (Iran)
432 19   Mobile Telecommunications Company of Esfahan (MTCE) (Iran)
432 32   Taliya (Iran)
432 35   MTN Irancell (Iran)
434 01   Buztel (UzbekistÃ¡n)
434 02   Uzmacom (UzbekistÃ¡n)
434 04   Beeline (UzbekistÃ¡n)
434 05   Coscom (UzbekistÃ¡n)
434 07   MTS (UzbekistÃ¡n)
436 01   JC Somoncom (TadjikistÃ¡n)
436 02   CJSC Indigo Tajikistan (TadjikistÃ¡n)
436 03   TT mobile (TadjikistÃ¡n)
436 04   Josa Babilon-T (TadjikistÃ¡n)
436 05   CTJTHSC Tajik-tel (TadjikistÃ¡n)
437 01   Bitel (KirgizstÃ¡n)
438 01   Barash Communication Technologies (BCTI) (TurkmenistÃ¡n)
438 02   TM-Cell (TurkmenistÃ¡n)
440 01   NTT DoCoMo (JapÃ³n)
440 02   NTT DoCoMo Kansai (JapÃ³n)
440 03   NTT DoCoMo Hokuriku (JapÃ³n)
440 04   Vodafone (JapÃ³n)
440 06   Vodafone (JapÃ³n)
440 07   KDDI Corporation (JapÃ³n)
440 08   KDDI Corporation (JapÃ³n)
440 09   NTT DoCoMo Kansai (JapÃ³n)
440 10   NTT DoCoMo Kansai (JapÃ³n)
440 11   NTT DoCoMo Tokai (JapÃ³n)
440 12   NTT DoCoMo (JapÃ³n)
440 13   NTT DoCoMo (JapÃ³n)
440 14   NTT DoCoMo Tohoku (JapÃ³n)
440 15   NTT DoCoMo (JapÃ³n)
440 16   NTT DoCoMo (JapÃ³n)
440 17   NTT DoCoMo (JapÃ³n)
440 18   NTT DoCoMo Tokai (JapÃ³n)
440 19   NTT DoCoMo Hokkaido (JapÃ³n)
440 20   NTT DoCoMo Hokuriku (JapÃ³n)
440 21   NTT DoCoMo (JapÃ³n)
440 22   NTT DoCoMo Kansai (JapÃ³n)
440 23   NTT DoCoMo Tokai (JapÃ³n)
440 24   NTT DoCoMo Chugoku (JapÃ³n)
440 25   NTT DoCoMo Hokkaido (JapÃ³n)
440 26   NTT DoCoMo Kyushu (JapÃ³n)
440 27   NTT DoCoMoTohoku (JapÃ³n)
440 28   NTT DoCoMo Shikoku (JapÃ³n)
440 29   NTT DoCoMo (JapÃ³n)
440 30   NTT DoCoMo (JapÃ³n)
440 31   NTT DoCoMo Kansai (JapÃ³n)
440 32   NTT DoCoMo (JapÃ³n)
440 33   NTT DoCoMo Tokai (JapÃ³n)
440 34   NTT DoCoMo Kyushu (JapÃ³n)
440 35   NTT DoCoMo Kansai (JapÃ³n)
440 36   NTT DoCoMo (JapÃ³n)
440 37   NTT DoCoMo (JapÃ³n)
440 38   NTT DoCoMo (JapÃ³n)
440 39   NTT DoCoMo (JapÃ³n)
440 40   Vodafone (JapÃ³n)
440 41   Vodafone (JapÃ³n)
440 42   Vodafone (JapÃ³n)
440 43   Vodafone (JapÃ³n)
440 44   Vodafone (JapÃ³n)
440 45   Vodafone (JapÃ³n)
440 46   Vodafone (JapÃ³n)
440 47   Vodafone (JapÃ³n)
440 48   Vodafone (JapÃ³n)
440 49   NTT DoCoMo (JapÃ³n)
440 50   KDDI Corporation (JapÃ³n)
440 51   KDDI Corporation (JapÃ³n)
440 52   KDDI Corporation (JapÃ³n)
440 53   KDDI Corporation (JapÃ³n)
440 54   KDDI Corporation (JapÃ³n)
440 55   KDDI Corporation (JapÃ³n)
440 56   KDDI Corporation (JapÃ³n)
440 58   NTT DoCoMo Kansai (JapÃ³n)
440 60   NTT DoCoMo Kansai (JapÃ³n)
440 61   NTT DoCoMo Chugoku (JapÃ³n)
440 62   NTT DoCoMo Kyushu (JapÃ³n)
440 63   NTT DoCoMo (JapÃ³n)
440 64   NTT DoCoMo (JapÃ³n)
440 65   NTT DoCoMo Shikoku (JapÃ³n)
440 66   NTT DoCoMo (JapÃ³n)
440 67   NTT DoCoMo Tohoku (JapÃ³n)
440 68   NTT DoCoMo Kyushu (JapÃ³n)
440 69   NTT DoCoMo (JapÃ³n)
440 70   KDDI Corporation (JapÃ³n)
440 71   KDDI Corporation (JapÃ³n)
440 72   KDDI Corporation (JapÃ³n)
440 73   KDDI Corporation (JapÃ³n)
440 74   KDDI Corporation (JapÃ³n)
440 75   KDDI Corporation (JapÃ³n)
440 76   KDDI Corporation (JapÃ³n)
440 77   KDDI Corporation (JapÃ³n)
440 78   Okinawa Cellular Telephone (JapÃ³n)
440 79   KDDI Corporation (JapÃ³n)
440 80   TU-KA Cellular Tokyo (JapÃ³n)
440 81   TU-KA Cellular Tokyo (JapÃ³n)
440 82   TU-KA Phone Kansai (JapÃ³n)
440 83   TU-KA Cellular Tokai (JapÃ³n)
440 84   TU-KA Phone Kansai (JapÃ³n)
440 85   TU-KA Cellular Tokai (JapÃ³n)
440 86   TU-KA Cellular Tokyo (JapÃ³n)
440 87   NTT DoCoMo Chugoku (JapÃ³n)
440 88   KDDI Corporation (JapÃ³n)
440 89   KDDI Corporation (JapÃ³n)
440 90   Vodafone (JapÃ³n)
440 92   Vodafone (JapÃ³n)
440 93   Vodafone (JapÃ³n)
440 94   Vodafone (JapÃ³n)
440 95   Vodafone (JapÃ³n)
440 96   Vodafone (JapÃ³n)
440 97   Vodafone (JapÃ³n)
440 98   Vodafone (JapÃ³n)
440 99   NTT DoCoMo (JapÃ³n)
450 02   KTF CDMA (Korea)
450 05   SK Telecom (Korea)
450 08   KTF WCDMA (Korea)
452 00   Mobifone / MTSC (Vietnam)
452 01   Mobifone / MTSC (Vietnam)
452 02   Vinaphone / DGPT (Vietnam)
452 03   S-Phone / S-Telecom (Vietnam)
452 98   HT Mobile / Hanoi Telecom (Vietnam)
452 99   E-Phone / EVN Telecom (Vietnam)
454 00   CSL (Hong Kong)
454 01   MVNO) (Hong Kong)
454 02   CSL 3G (Hong Kong)
454 03   Hutchison Telecom / 3 (3G) (Hong Kong)
454 04   Hutchison Telecom / 3 (2G) (Hong Kong)
454 05   Hutchison Telecom / 3 CDMA (Hong Kong)
454 06   SmarTone Mobile Comms / Smartone-Vodafone (Hong Kong)
454 07   MVNO) (Hong Kong)
454 08   MVNO) (Hong Kong)
454 09   MVNO) (Hong Kong)
454 10   New World PCS (Hong Kong)
454 11   MVNO) (Hong Kong)
454 12   China Mobile Peoples Telephone Company (Hong Kong)
454 14   Hutchison Telecom (Hong Kong)
454 15   SMT (UMTS) (Hong Kong)
454 16   PCCW Mobile (PCCW Ltd) (Hong Kong)
454 17   SmarTone (Hong Kong)
454 18   Hong Kong Telecom CSL / Pacific Link (Hong Kong)
454 19   PCCW Mobile (PCCW Ltd) (Hong Kong)
455 00   Smartone Mobile Communications (Macao) Ltd (Macao)
455 01   C.T.M. Telemovel+ (Macao)
455 03   Hutchison Telecom / 3 (Macao)
456 01   Mobitel / Cam GSM (Camboya)
456 02   Samart / Casacom (Camboya)
456 03   S Telecom (Camboya)
456 04   Cadcomms (Camboya)
456 18   Camshin / Shinawatra (Camboya)
457 01   Lao Shinawatra Telecom (Laos)
457 02   ETL Mobile (Laos)
457 08   Millicom (Laos)
460 00   China Mobile (China)
460 01   China Unicom (China)
466 01   FarEasTone (TaiwÃ¡n)
466 06   Tuntex Telecom (TaiwÃ¡n)
466 11   Chunghwa (TaiwÃ¡n)
466 88   KG Telecom (TaiwÃ¡n)
466 89   VIBO Telecom (TaiwÃ¡n)
466 92   LDTA (TaiwÃ¡n)
466 93   Mobitai Communications (TaiwÃ¡n)
466 97   Pacific Cellular TWN GSM (TaiwÃ¡n)
466 99   TransAsia Telecoms (TaiwÃ¡n)
472 01   DhiMobile (Islas Maldivas)
472 02   Choq Mobile (Islas Maldivas)
502 00   Art900 (Malasia)
502 02   My BSB (Malasia)
502 03   Binariang (Malasia)
502 12   Maxis / Binariang Communications (Malasia)
502 13   Celcom TM / TM Touch (Malasia)
502 16   DiGi Telecommunications (Malasia)
502 17   TimeCel / Binariang Communications Maxis (Malasia)
502 19   Celcom TM (Malasia)
505 01   Telstra (Australia)
505 02   Optus (Australia)
505 03   Vodafone (Australia)
505 038  Crazy John's (Australia)
505 04   Department of Defence (Australia)
505 05   Ozitel (Australia)
505 06   Hutchison 3G (3) (Australia)
505 07   Vodafone (Australia)
505 08   One. Tel (Australia)
505 09   Airnet (Australia)
505 11   Telstra (Australia)
505 12   Hutchison 3G (3) (Australia)
505 14   AAPT (Australia)
505 15   3GIS (Australia)
505 24   Advanced Communications Technologies (Australia)
505 71   Telstra (Australia)
505 72   Telstra (Australia)
505 88   Localstar (Australia)
505 90   Optus (Australia)
505 99   One. Tel (Australia)
510 00   PSN (Indonesia)
510 01   PT Satelindo / PT Satelit Palapa / INDOSAT (Indonesia)
510 08   Natrindo (Lippo Telecom) (Indonesia)
510 10   Telkomsel (Indonesia)
510 11   PT Excelcomindo Excelcom / proXL (Indonesia)
510 21   IND IM3 / INDOSAT (Indonesia)
510 28   Komselindo (Indonesia)
510 89   Hutchinson Telecommunication Indonesia / HCPT (Indonesia)
520 00   CAT CDMA (Tailandia)
520 01   AIS / Advanced Info Service GSM (Tailandia)
520 10   WCS IQ (Tailandia)
520 15   Thai Mobile / ACT Mobile (Tailandia)
520 18   DTAC / Total Access Comms (Tailandia)
520 23   Digital Phone Hello (Tailandia)
520 99   True / Orange (Tailandia)
525 01   Singapore Telecom / SingTel (Singapur)
525 02   Singapore Telecom / SingTel (Singapur)
525 03   MobileOne Asia / SGP-M1-3GS (Singapur)
525 05   StarHub (Singapur)
525 12   Digital Trunked Radio Network (Singapur)
528 01   Jabatan Telekom (Brunei Darussalam)
528 02   BRU-bmobile (Brunei Darussalam)
528 11   DST Communications (Brunei Darussalam)
530 00   Telecom New Zealand (AMPS MIN based IMSI's) (Nueva Zelanda)
530 01   Vodafone New Zealand (Nueva Zelanda)
530 02   Telecom New Zealand (CDMA Mobile Network) (Nueva Zelanda)
530 03   Woosh Wireless New Zealand (Nueva Zelanda)
530 04   TelstraClear New Zealand (Nueva Zelanda)
530 28   Econet Wireless New Zealand (Nueva Zelanda)
537 01   Pacific Mobile Comms (PapÃºa Nueva Guinea)
539 01   Tonga Communications Corporation (Tonga)
539 43   Shoreline Communication (Tonga)
541 01   SMILE (Vanuatu)
542 01   Vodafone (Fiyi)
546 01   OPT Mobilis (Nueva Caledonia)
547 20   Tikiphone (Polinesia Francesa)
548 01   Telecom Cook (Islas Cook)
549 01   Telecom Samoa Cellular Ltd. (Samoa)
550 01   FSM Telecom (Micronesia)
552 01   Palau National Communications Corp. - PNCC (Palau)
602 01   Mobinil (Egipto)
602 02   Vodafone (Egipto)
602 03   Etisalat (Egipto)
603 01   ATM Mobilis (Algeria)
603 02   Djezzy (Algeria)
603 03   Nedjma (Algeria)
604 00   Meditel (Marruecos)
604 01   IAM / Ittissalat Al Maghrib / Maroc Telecom (Marruecos)
605 02   Tunicell / Tunisian PTT / Tunisie Telecom (Tunez)
605 03   Orascom Telecom (Tunez)
606 00   Libyana (Libia)
606 01   AlMadar (Libia)
607 01   Gamcel (Gambia)
607 02   Africel (Gambia)
608 01   Sonatel ALIZE (Senegal)
608 02   Sentel GSM (Senegal)
609 01   Mattel (Mauritania)
610 01   Malitel (Mali)
611 01   Spacetel (Guinea)
611 02   Sotelgui Lagui (Guinea)
612 01   Cora de Comstar (Ivory Coast)
612 02   Moov (Ivory Coast)
612 03   Orange (Ivory Coast)
612 04   KOZ de Comium (Ivory Coast)
612 05   MTN (Ivory Coast)
613 01   Onatel (Burquina Faso)
613 02   Celtel (Burquina Faso)
613 03   Telecel / Moov (Burquina Faso)
614 01   Sahel.Com (Niger)
614 02   Celtel (Niger)
614 03   Telecel (Niger)
615 01   Togo Telecom / TOGO CELL (Togo)
616 01   Libercom (BenÃ­n)
616 02   Telecel / Moov (BenÃ­n)
616 03   Spacetel Benin (BenÃ­n)
617 01   Cellplus (Mauricio)
617 02   Mahanagar Telephone (Mauritius) Ltd. (Mauricio)
617 10   Emtel (Mauricio)
618 01   Omega Communications (Liberia)
618 04   Comium Liberi (Liberia)
619 01   Celtel (Sierra Leona)
619 02   Millicom (Sierra Leona)
619 03   Datatel (Sierra Leona)
619 04   Comium (Sierra Leona)
619 05   Africell (Sierra Leona)
619 25   Mobitel (Sierra Leona)
620 01   MTN - Areeba / ScanCom (Ghana)
620 02   Onetouch / Ghana Telecom (Ghana)
620 03   Tigo / Mobitel (Ghana)
621 20   Celtel / V-Mobile / Econet Wireless Nigeria Ltd. (Nigeria)
621 30   MTN (Nigeria)
621 40   Nigeria Telecommunications Ltd. (Nigeria)
621 50   Glo (Nigeria)
622 01   Celtel (Chad)
622 02   Tchad Mobile (Chad)
623 01   Centrafrique Telecom Plus (CTP) (Centro-africana, RepÃºblica)
623 02   Telecel Centrafrique (TC) (Centro-africana, RepÃºblica)
623 03   Orange RCA (Centro-africana, RepÃºblica)
623 04   Nationlink RCA (Centro-africana, RepÃºblica)
624 01   Mobile Telephone Network (CamerÃºn)
624 02   Orange (CamerÃºn)
625 01   Cabo Verde Telecom (Cabo Verde)
626 01   Companhia Santomese de Telecomunicacoes (CSTmovel) (Santo TomÃ© y PrÃ­ncipe)
628 01   Libertis S.A. (GabÃ³n)
628 02   Moov (Telecel) Gabon S.A. (GabÃ³n)
628 03   Celtel Gabon S.A. (GabÃ³n)
629 01   Celtel (Republic of Congo)
629 10   Libertis Telecom (Republic of Congo)
630 01   Vodacom Congo RDC sprl (Democratic Republic of the Congo)
630 86   Congo-Chine Telecom s.a.r.l. (Democratic Republic of the Congo)
631 02   UNITEL (Angola)
632 02   Spacetel Guine-Bissau S.A. (Guinea-Bissau)
633 01   Cable & Wireless (Seychelles) Ltd. (Seychelles)
633 02   Mediatech International Ltd. (Seychelles)
633 10   Telecom Airtel (Seychelles)
634 01   Mobitel / Mobile Telephone Company (SudÃ¡n)
634 02   MTN Sudan (SudÃ¡n)
635 10   Rwandacell / MTN (Ruanda)
636 01   ETH MTN / Ethiopian Telecoms Auth. (EtiopÃ­a)
638 01   Evatis (Yibuti)
639 02   Safaricom Ltd. (Kenia)
639 03   Kencell Communications Ltd. (Kenia)
640 01   Tritel (Tanzania)
640 02   MIC (Tanzania)
640 03   Zantel (Tanzania)
640 04   Vodacom (Tanzania)
640 05   Celtel (Tanzania)
641 01   Celtel Cellular (Uganda)
641 10   MTN Uganda (Uganda)
641 11   Uganda Telecom Ltd. (Uganda)
642 01   Spacetel Burundi (Burundi)
642 02   Safaris (Burundi)
642 03   Telecel Burundi Company (Burundi)
643 01   Mocambique Celular S.A.R.L (mCel) (Mozambique)
643 04   VM, S.A.R.L. (Vodacom Mozambique) (Mozambique)
645 01   Celtel (Zambia)
645 02   Telecel (Zambia)
645 03   MTN (Zambia)
646 01   Madacom (Madagascar)
646 02   Orange (Madagascar)
646 03   Sacel (Madagascar)
647 00   Orange La Reunion (ReuniÃ³n)
647 02   Outremer Telecom (ReuniÃ³n)
647 10   SRR / Societe Reunionnaise du Radiotelephone (ReuniÃ³n)
648 01   Net One (Zimbabue)
648 03   Telecel (Zimbabue)
648 04   Econet (Zimbabue)
649 01   MTC (Namibia)
650 01   TNL / Telecom Network Callpoint (Malawi)
650 10   Celtel ltd. (Malawi)
651 01   Vodacom (Lesoto)
651 02   Econet Ezin-cel (Lesoto)
652 01   Mascom Wireless (Botsuana)
652 02   Orange Botswana (Botsuana)
653 10   Swazi MTN (Swazilandia)
654 01   HURI - SNPT (Comores, Islas)
655 01   Vodacom (SurÃ¡frica)
655 06   Sentech (Pty) Ltd. (SurÃ¡frica)
655 07   Cell C (SurÃ¡frica)
655 10   MTN / Mobile Telephone Networks (SurÃ¡frica)
655 11   SAPS Gauteng (SurÃ¡frica)
655 21   Cape Town Metropolitan Council (SurÃ¡frica)
655 30   Bokamoso Consortium (SurÃ¡frica)
655 31   Karabo Telecoms (Pty) Ltd. (SurÃ¡frica)
655 32   Ilizwi Telecommunications (SurÃ¡frica)
655 33   Thinta Thinta Telecommunications (SurÃ¡frica)
702 67   Belize Telecommunications Ltd. (Belice)
702 68   International Telecommunications Ltd. (Belice)
704 01   SERCOM / PCS Digital / Claro (Guatemala)
704 02   Comcel / Tigo (Guatemala)
704 03   Telefonica Moviles Guatemala (movistar) (Guatemala)
706 01   Personal / Telecom / Claro (El Salvador)
706 02   Digicel Group (digicel) (El Salvador)
706 03   Telemovil (Millicom) / Tigo (El Salvador)
706 04   Telefonica Moviles El Salvador (movistar) (El Salvador)
706 10   Personal / Telecom / Claro (El Salvador)
708 01   Megatel / Alo / Claro (Honduras)
708 02   Celtel / Tigo (Honduras)
708 30   Hondutel (Honduras)
710 21   Empresa Nicaraguense de Telecomunicaciones, S.A. (Claro) (Nicaragua)
710 30   Telefonica Moviles Nicaragua (movistar) (Nicaragua)
710 73   SERCOM / Servicios de Comunicaciones S.A. / Claro (Nicaragua)
712 01   Instituto Costarricense de Electricidad (ICE) (Costa Rica)
712 02   Instituto Costarricense de Electricidad (ICE) (Costa Rica)
714 01   Cable & Wireless Panama S.A. (PanamÃ¡)
714 02   BSC de Panama S.A. (movistar) (PanamÃ¡)
716 07   Telefonica Moviles Peru (movistar) (PerÃº)
716 10   TIM Peru / America Movil Peru / Claro (PerÃº)
722 010  Compania de Radiocomunicaciones Moviles S.A. (Movicom) (Argentina)
722 020  Nextel Argentina srl (Argentina)
722 070  Unifon (Argentina)
722 310  CTI PCS S.A. (Argentina)
722 320  CTI Movil (Argentina)
722 330  CTI Movil (Argentina)
722 340  Telecom Personal (Argentina)
722 350  Hutchinson (PORT HABLE) (Argentina)
724 00   Telet (Brasil)
724 01   CRT Celular (Brasil)
724 02   TIM (Brasil)
724 03   TIM (Brasil)
724 04   TIM (Brasil)
724 05   Claro (Brasil)
724 06   Claro (former Tess) (Brasil)
724 07   Sercontel Celular (Brasil)
724 08   Maxitel (Brasil)
724 09   Telepar Celular (Brasil)
724 10   Vivo (SP) (Brasil)
724 11   Vivo (Brasil)
724 12   Claro (Former Americel) (Brasil)
724 13   Vivo (Former Telesp Celular) (Brasil)
724 14   Maxitel BA (Brasil)
724 15   CTBC Celular (Brasil)
724 16   Brasil Telecom (Brasil)
724 17   Ceterp Celular (Brasil)
724 18   Oi (also known as Telemar / Norte Brasil Telecom) (Brasil)
724 19   Telemig Celular (Brasil)
724 21   Telerj Celular (Brasil)
724 23   Telest Celular (Brasil)
724 25   Telebrasilia Celular (Brasil)
724 27   Telegoias Celular (Brasil)
724 29   Telemat Celular (Brasil)
724 31   Oi (Brasil)
724 33   Teleron Celular (Brasil)
724 35   Telebahia Celular (Brasil)
724 37   Telergipe Celular (Brasil)
724 39   Telasa Celular (Brasil)
724 41   Telpe Celular (Brasil)
724 43   Telepisa Celular (Brasil)
724 45   Telpa Celular (Brasil)
724 47   Telem Celular (Brasil)
724 48   Teleceara Celular (Brasil)
724 51   Telma Celular (Brasil)
724 53   Telepara Celular (Brasil)
724 55   Teleamazon Celular (Brasil)
724 57   Teleamapa Celular (Brasil)
724 59   Telaima Celular (Brasil)
730 01   Entel Telefonia Movil (Chile)
730 02   Movistar Chile (Chile)
730 03   Claro Chile (Chile)
730 10   Entel PCS Telecom (Chile)
732 001  Colombia Telecomunicaciones S.A. - Telecom (Colombia)
732 002  Edatel S.A. (Colombia)
732 101  Comcel S.A. Occel S.A. / Celcaribe (Colombia)
732 102  Bellsouth Colombia S.A. (movistar) (Colombia)
732 103  Colombia Movil S.A. (Colombia)
732 111  Colombia Movil S.A. (Colombia)
732 123  Telefonica Moviles Colombia S.A. (movistar) (Colombia)
734 01   Digitel / Infonet (Venezuela)
734 02   Digitel (Venezuela)
734 03   Digitel / Digicel (Venezuela)
734 04   Telefonica Moviles Venezuela (movistar) (Venezuela)
738 01   Cel*Star (Guyana)
740 00   Otecel S.A. - (formerly Bellsouth) (Movistar) (Ecuador)
740 01   Porta GSM (Ecuador)
740 02   Telecsa S.A. (Ecuador)
744 01   VOX / Hola Paraguay S.A. (Paraguay)
744 02   Hutchison Telecom S.A. / America Movil Paraguay / CTI Movil (Paraguay)
744 03   Compania Privada de Comunicaciones S.A. (Paraguay)
744 04   Telecel / Tigo (Paraguay)
746 02   Telesu (SurinÃ¡m)
748 00   Ancel (Uruguay)
748 01   Ancel (Uruguay)
748 10   America Movil Uruguay / CTI Movil (Uruguay)
880 11   CityCell (Bangladesh)
880 15   TeleTalk (Bangladesh)
880 16   Warid Tel (Bangladesh)
880 17   GP (Grameen Phone) (Bangladesh)
880 18   AKtel (A. Khan Telecom) (Bangladesh)
880 19   BanglaLink (Bangladesh)
901 01   ICO Global Communications (International)
901 02   Sense Communications International (International)
901 03   Iridium Satellite (International)
901 04   Globalstar (GMSS) (International)
901 05   Thuraya RMSS Network (International)
901 06   Thuraya Satellite Telecommunications Company (International)
901 07   Ellipso (International)
901 08   Reserved for station identification where the mobile does not have a subscription IMSI (International)
901 09   Tele1 Europe (International)
901 10   Asia Cellular Satellite (AceS) (International)
901 11   Inmarsat (International)
901 12   Maritime Communications Partner AS (MCP) (International)
901 13   Global Networks (International)
901 14   Telenor GSM - services in aircraft (International)
901 15   SITA GSM - services in aircraft (International)
901 18   Cingular Wireless (International)
gnokii> --help
gnokii> --help or[Kther
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
Misc options:
          --keysequence
          --enterchar
          --listnetworks
          --getnetworkinfo
gnokii> --phonebook
gnokii> --help phonebook
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
Phonebook options:
          --getphonebook memory_type start_number [end_number|end]
                 [[-r|--raw]|[-v|--vcard]|[-l|--ldif]]
          --writephonebook [[-o|--overwrite]|[-f|--find-free]]
                 [-m|--memory-type|--memory memory_type]
                 [-n|--memory-location|--location number]
                 [[-v|--vcard]|[-l|--ldif]]
          --deletephonebook memory_type start_number [end_number|end]
gnokii> --help [K[K[K[K[Kgetphonebook [K
gnokii> --gert[K[Ktphonebook SD
gnokii> -hh[Ke[K[K-help getphonebook
Usage:
	gnokii [CONFIG OPTIONS] OPTIONS

CONFIG OPTIONS
		--config filename
		--phone phone_section

OPTIONS
Use just one option at a time.
General options:
          --help [all] [monitor] [sms] [mms] [phonebook] [calendar] [todo]
                 [dial] [profile] [settings] [wap] [logo] [ringtone]
                 [security] [file] [other]
          --version
          --shell
gnokii> 